{
  "title": "Examining the Convergence of Denoising Diffusion Probabilistic\nModels: A Quantitative Analysis",
  "abstract": "provides a precise upper limit for the Wasserstein distance between a learned distribution by a diffusion model\nand the target distribution. In contrast to earlier research, this analysis does not rely on presumptions regarding\nthe learned score function. Furthermore, the findings are applicable to any data-generating distributions within\nrestricted instance spaces, even those lacking a density relative to the Lebesgue measure, and the upper limit is not\nexponentially dependent on the ambient space dimension. The primary finding expands upon recent research by\nMbacke et al. (2023), and the proofs presented are fundamental.",
  "introduction": "families of deep generative models. These models have demonstrated remarkable empirical results in generating images and audio,\nas well as in various other applications.\n\nTwo primary methods exist for diffusion models: denoising diffusion probabilistic models (DDPMs) and score-based generative\nmodels (SGMs). DDPMs incrementally convert samples from the desired distribution into noise via a forward process, while\nsimultaneously training a backward process to reverse this transformation, enabling the creation of new samples. Conversely, SGMs\nemploy score-matching methods to approximate the score function of the data-generating distribution, subsequently generating new\nsamples through Langevin dynamics. Recognizing that real-world distributions might lack a defined score function, adding varying\nnoise levels to training samples to encompass the entire instance space and training a neural network to concurrently learn the score\nfunction for all noise levels has been proposed.\n\nAlthough DDPMs and SGMs may initially seem distinct, it has been demonstrated that DDPMs implicitly approximate the score\nfunction, with the sampling process resembling Langevin dynamics. Moreover, a unified perspective of both methods using stochastic\ndifferential equations (SDEs) has been derived. The SGM can be viewed as a discretization of Brownian motion, and the DDPM as a\ndiscretization of an Ornstein-Uhlenbeck process. Consequently, both DDPMs and SGMs are commonly referred to as SGMs in the\nliterature. This explains why prior research investigating the theoretical aspects of diffusion models has adopted the score-based\nframework, necessitating assumptions about the effectiveness of the learned score function.\n\nIn this research, a different strategy is employed, applying methods created for VAEs to DDPMs, which can be viewed as hierarchical\nVAEs with fixed encoders. This method enables the derivation of quantitative, Wasserstein-based upper bounds without making\nassumptions about the data distribution or the learned score function, and with simple proofs that do not need the SDE toolkit.\nFurthermore, the bounds presented here do not involve any complex discretization steps, as the forward and backward processes are\nconsidered discrete-time from the beginning, rather than being viewed as discretizations of continuous-time processes.\n\n1.1 Related Works\n\nThere has been an increasing amount of research aimed at providing theoretical findings on the convergence of SGMs. However,\nthese studies frequently depend on restrictive assumptions regarding the data-generating distribution, produce non-quantitative upper\nbounds, or exhibit exponential dependencies on certain parameters. This work successfully circumvents all three of these limitations.\nSome bounds are based on very restrictive assumptions about the data-generating distribution, such as log-Sobolev inequalities,\nwhich are unrealistic for real-world data distributions. Furthermore, some studies establish upper bounds on the Kullback-Leibler\n(KL) divergence or the total variation (TV) distance between the data-generating distribution and the distribution learned by the\ndiffusion model; however, unless strong assumptions are made about the support of the data-generating distribution, KL and TV\nreach their maximum values. Such assumptions arguably do not hold for real-world data-generating distributions, which are widely\nbelieved to satisfy the manifold hypothesis. Other work establishes conditions under which the support of the input distribution\nis equal to the support of the learned distribution, and generalizes the bound to all f-divergences. Assuming L2 accurate score\n\n\festimation, some establish Wasserstein distance upper bounds under weaker assumptions on the data-generating distribution, but\ntheir Wasserstein-based bounds are not quantitative. Quantitative Wasserstein distance upper bounds under the manifold hypothesis\nhave been derived, but these bounds exhibit exponential dependencies on some of the problem parameters.\n\n1.2 Our contributions\n\nIn this study, strong assumptions about the data-generating distribution are avoided, and a quantitative upper bound on the Wasserstein\ndistance is established without exponential dependencies on problem parameters, including the ambient space dimension. Moreover,\na common aspect of the aforementioned studies is that their bounds are contingent on the error of the score estimator. According to\nsome, providing precise guarantees for the estimation of the score function is challenging, as it necessitates an understanding of the\nnon-convex training dynamics of neural network optimization, which is currently beyond reach. Therefore, upper bounds are derived\nwithout making assumptions about the learned score function. Instead, the bound presented here is dependent on a reconstruction\nloss calculated over a finite independent and identically distributed (i.i.d.) sample. Intuitively, a loss function is defined, which\nquantifies the average Euclidean distance between a sample from the data-generating distribution and the reconstruction obtained by\nsampling noise and passing it through the backward process (parameterized by ˘03b8). This method is inspired by previous work on\nVAEs.\n\nThis approach offers numerous benefits: it does not impose restrictive assumptions on the data-generating distribution, avoids\nexponential dependencies on the dimension, and provides a quantitative upper bound based on the Wasserstein distance. Furthermore,\nthis method benefits from utilizing very straightforward and basic proofs.\n\n2 Preliminaries\n\nThroughout this paper, lowercase letters are used to represent both probability measures and their densities with respect to the\nLebesgue measure, and variables are added in parentheses to enhance readability (e.g., q(xt|xt−1) to denote a time-dependent\nconditional distribution). An instance space X, which is a subset of RD with the Euclidean distance as the underlying metric, and\na target data-generating distribution µ ∈ M +\n1 (X) are considered. Note that it is not assumed that µ has a density with respect to\nthe Lebesgue measure. Additionally, || · || represents the Euclidean (L2) norm, and Ep(x) is used as shorthand for Ex∼p(x). Given\nprobability measures p, q ∈ M +\n\n1 (X) and a real number k > 1, the Wasserstein distance of order k is defined as (Villani, 2009):\n\nWk(p, q) = inf\n\nγ∈Γ(p,q)\n\n(cid:18)(cid:90)\n\nX×X\n\n||x − y||kdγ(x, y)\n\n(cid:19)1/k\n\n,\n\nwhere Γ(p, q) denotes the set of couplings of p and q, meaning the set of joint distributions on X × X with respective marginals p\nand q. The product measure p ⊗ q is referred to as the trivial coupling, and the Wasserstein distance of order 1 is simply referred to\nas the Wasserstein distance.\n\n2.1 Denoising Diffusion Models\n\nInstead of employing the SDE framework, diffusion models are presented using the DDPM formulation with discrete-time processes.\nA diffusion model consists of two discrete-time stochastic processes: a forward process and a backward process. Both processes are\nindexed by time 0 ≤ t ≤ T , where the number of time steps T is a predetermined choice.\n\n**The forward process.** The forward process transforms a data point x0 ∼ µ into a noise distribution q(xT |x0) through a sequence\nof conditional distributions q(xt|xt−1) for 1 ≤ t ≤ T . It is assumed that the forward process is defined such that for sufficiently\nlarge T , the distribution q(xT |x0) is close to a simple noise distribution p(xT ), which is referred to as the prior distribution. For\ninstance, p(xT ) = N (xT ; 0, I), the standard multivariate normal distribution, has been chosen in previous work.\n\n**The backward process.** The backward process is a Markov process with parametric transition kernels. The objective of the\nbackward process is to perform the reverse operation of the forward process: transforming noise samples into (approximate) samples\nfrom the distribution µ. Following previous work, it is assumed that the backward process is defined by Gaussian distributions\npθ(xt−1|xt) for 2 ≤ t ≤ T as\n\nand\n\npθ(x0|x1) = gθ\n\n1(x1),\n\npθ(xt−1|xt) = N (xt−1; gθ\n\nt (xt), σ2\n\nt I),\n\nwhere the variance parameters σ2\nneural network (with parameters θ) for 2 ≤ t ≤ T , and gθ\nnetwork has been used for the functions gθ\n\nt ∈ R≥0 are defined by a fixed schedule, the mean functions gθ\n\nt : RD → RD are learned using a\n1 : RD → X is a separate function dependent on σ1. In practice, the same\n\nt for 2 ≤ t ≤ T , and a separate discrete decoder for gθ\n1.\n\n2\n\n\fGenerating new samples from a trained diffusion model is accomplished by sampling xt−1 ∼ pθ(xt−1|xt) for 1 ≤ t ≤ T , starting\nfrom a noise vector xT ∼ p(xT ) sampled from the prior p(xT ).\n\nThe following assumption is made regarding the backward process.\n**Assumption 1.** It is assumed that for each 1 ≤ t ≤ T , there exists a constant K θ\n\nt > 0 such that for every x1, x2 ∈ X,\n\n||gθ\n\nt (x1) − gθ\n\nt (x2)|| ≤ K θ\n\nt ||x1 − x2||.\n\nIn other words, gθ\n\nt is K θ\n\nt -Lipschitz continuous. This assumption is discussed in Remark 3.2.\n\n2.2 Additional Definitions\n\nThe distribution πθ(·|x0) is defined as\n\nπθ(·|x0) = q(xT |x0)pθ(xT −1|xT )pθ(xT −2|xT −1) . . . pθ(x1|x2)pθ(·|x1).\n\nIntuitively, for each x0 ∈ X, πθ(·|x0) represents the distribution on X obtained by reconstructing samples from q(xT |x0) through\nthe backward process. Another way to interpret this distribution is that for any function f : X → R, the following equation holds:\n\nEπθ(ˆx0|x0)[f (ˆx0)] = Eq(xT |x0)Epθ(xT −1|xT ) . . . Epθ(x1|x2)Epθ(ˆx0|x1)[f (ˆx0)].\n\nGiven a finite set S = {x1\n\n0, . . . , xn\n\n0 } i.i.d. ∼ µ, the regenerated distribution is defined as the following mixture:\n\nµθ\n\nn =\n\n1\nn\n\nn\n(cid:88)\n\ni=1\n\nπθ(·|xi\n\n0).\n\nThis definition is analogous to the empirical regenerated distribution defined for VAEs. The distribution on X learned by the\ndiffusion model is denoted as πθ(·) and defined as\n\nIn other words, for any function f : X → R, the expectation of f with respect to πθ(·) is\n\nπθ(·) = p(xT )pθ(xT −1|xT )pθ(xT −2|xT −1) . . . pθ(x1|x2)pθ(·|x1).\n\nEπθ(ˆx0)[f (ˆx0)] = Ep(xT )Epθ(xT −1|xT ) . . . Epθ(x1|x2)Epθ(ˆx0|x1)[f (ˆx0)].\n\nHence, both πθ(·) and πθ(·|x0) are defined using the backward process, with the difference that πθ(·) starts with the prior\np(xT ) = N (xT ; 0, I), while πθ(·|x0) starts with the noise distribution q(xT |x0).\n\nFinally, the loss function lθ : X × X → R is defined as\n\nlθ(xT , x0) = Epθ(xT −1|xT )Epθ(xT −2|xT −1) . . . Epθ(x1|x2)Epθ(ˆx0|x1)[||x0 − ˆx0||].\n\nHence, given a noise vector xT and a sample x0, the loss lθ(xT , x0) represents the average Euclidean distance between x0 and any\nsample obtained by passing xT through the backward process.\n\n2.3 Our Approach\n\nThe goal is to upper-bound the distance W1(µ, πθ(·)). Since the triangle inequality implies\n\nW1(µ, πθ(·)) ≤ W1(µ, µθ\n\nn) + W1(µθ\n\nn, πθ(·)),\n\nn) is obtained using a straightforward adaptation of a proof. First, W1(µ, µθ\n\nthe distance W1(µ, πθ(·)) can be upper-bounded by upper-bounding the two expressions on the right-hand side separately. The\nupper bound on W1(µ, µθ\nn) is upper-bounded using the\nexpectation of the loss function lθ, then the resulting expression is upper-bounded using a PAC-Bayesian-style expression dependent\non the empirical risk and the prior-matching term.\nThe upper bound on the second term W1(µθ\nis determined by the corresponding initial distributions: q(xT |xi\nclose, and if the steps of the backward process are smooth (see Assumption 1), then πθ(·|xi\n\nn. Intuitively, the difference between πθ(·|xi\n0) and πθ(·)\n0) and p(xT ) for πθ(·). Hence, if the two initial distributions are\n\nn, πθ(·)) uses the definition of µθ\n\n0) and πθ(·) are close to each other.\n\n3\n\n\f3 Main Result\n\n3.1 Theorem Statement\n\nWe are now ready to present the main result: a quantitative upper bound on the Wasserstein distance between the data-generating\ndistribution µ and the learned distribution πθ(·).\n**Theorem 3.1.** Assume the instance space X has finite diameter ∆ = supx,x′∈X ||x − x′|| < ∞, and let λ > 0 and δ ∈ (0, 1) be\nreal numbers. Using the definitions and assumptions of the previous section, the following inequality holds with probability at least\n1 − δ over the random draw of S = {x1\n\n0, . . . , xn\n\n0 } i.i.d. ∼ µ:\n\nW1(µ, πθ(·)) ≤\n\n1\nn\n\n+\n\n+\n\nn\n(cid:88)\n\nEq(xT |xi\n\n0)[lθ(xT , xi\n\n0)] +\n\n1\nλn\n\nn\n(cid:88)\n\ni=1\n\nKL(q(xT |xi\n\n0)||p(xT )) +\n\n1\nλn\n\nlog\n\nn\nδ\n\n+\n\nλ∆2\n8n\n\ni=1\n(cid:32) T\n(cid:89)\n\n(cid:33)\n\nK θ\nt\n\nEq(xT |xi\n\n0)Ep(yT )[||xT − yT ||]\n\nt=1\n\nT\n(cid:88)\n\n(cid:32)t−1\n(cid:89)\n\nt=2\n\ni=1\n\n(cid:33)\n\nK θ\ni\n\nσtEϵ,ϵ′[||ϵ − ϵ′||],\n\nwhere ϵ, ϵ′ ∼ N (0, I) are standard Gaussian vectors.\n\n**Remark 3.1.** Before presenting the proof, let us discuss Theorem 3.1.\n\n0) is only computed with respect to the noise distribution q(xT |xi\n\n* Because the right-hand side of the equation depends on a quantity computed using a finite i.i.d. sample S, the bound holds with\nhigh probability with respect to the randomness of S. This is the price we pay for having a quantitative upper bound with no\nexponential dependencies on problem parameters and no assumptions on the data-generating distribution µ. * The first term of the\nright-hand side is the average reconstruction loss computed over the sample S = {x1\n0 }. Note that for each 1 ≤ i ≤ n, the\nexpectation of lθ(xT |xi\n0 itself. Hence, this term\nmeasures how well a noise vector xT ∼ q(xT |xi\n0 using the backward process, and averages over\nthe set S = {x1\nt < 1 for all 1 ≤ t ≤ T , then the larger T is, the smaller the upper\nbound gets. This is because the product of K θ\nt < 1\nfor all t is a quite reasonable one. * The hyperparameter λ controls the trade-off between the prior-matching (KL) term and the\ndiameter term ∆2. If K θ\nt < 1 for all 1 ≤ t ≤ T and T → ∞, then the convergence of the bound largely depends on the choice of λ.\nIn that case, λ ∝ n1/2 leads to faster convergence, while λ ∝ n leads to slower convergence to a smaller quantity. This is because\nthe bound stems from PAC-Bayesian theory, where this trade-off is common. * The last term of the equation does not depend on the\nsample size n. Hence, the upper bound given by Theorem 3.1 does not converge to 0 as n → ∞. However, if the Lipschitz factors\n(K θ\n\nt ’s then converges to 0. In Remark 3.2 below, we show that the assumption that K θ\n\nt )1≤t≤T are all less than 1, then this term can be very small, especially in low-dimensional spaces.\n\n0 }. * If the Lipschitz constants satisfy K θ\n\n0) recovers the original sample xi\n\n0) defined by xi\n\n0, . . . , xn\n\n0, . . . , xn\n\n3.2 Proof of the main theorem\n\nThe following result is an adaptation of a previous result.\n\n**Lemma 3.2.** Let λ > 0 and δ ∈ (0, 1) be real numbers. With probability at least 1 − δ over the randomness of the sample\nS = {x1\n\n0 } i.i.d. ∼ µ, the following holds:\n\n0, . . . , xn\n\nW1(µ, µθ\n\nn) ≤\n\n1\nn\n\nn\n(cid:88)\n\ni=1\n\nEq(xT |xi\n\n0)[lθ(xT , xi\n\n0)] +\n\n1\nλn\n\nn\n(cid:88)\n\ni=1\n\nKL(q(xT |xi\n\n0)||p(xT )) +\n\n1\nλn\n\nlog\n\nn\nδ\n\n+\n\nλ∆2\n8n\n\n.\n\nThe proof of this result is a straightforward adaptation of a previous proof.\nNow, let us focus our attention on the second term of the right-hand side of the equation, namely W1(µθ\nn, πθ(·)). This part is trickier\nthan for VAEs, for which the generative model’s distribution is simply a pushforward measure. Here, we have a non-deterministic\nsampling process with T steps.\n\nAssumption 1 leads to the following lemma on the backward process.\n\n**Lemma 3.3.** For any given x1, y1 ∈ X, we have\n\nMoreover, if 2 ≤ t ≤ T , then for any given xt, yt ∈ X, we have\n\nEpθ(x0|x1)Epθ(y0|y1)[||x0 − y0||] ≤ K θ\n\n1 ||x1 − y1||.\n\n4\n\n\fEpθ(xt−1|xt)Epθ(yt−1|yt)[||xt−1 − yt−1||] ≤ K θ\n\nt ||xt − yt|| + σtEϵ,ϵ′[||ϵ − ϵ′||],\n\nwhere ϵ, ϵ′ ∼ N (0, I), meaning Eϵ,ϵ′ is a shorthand for Eϵ,ϵ′∼N (0,I).\n\n**Proof.** For the first part, let x1, y1 ∈ X. Since according to the equation pθ(x0|x1) = δgθ\nthen\n\n1 (x1)(x0) and pθ(y0|y1) = δgθ\n\n1 (y1)(y0),\n\nEpθ(x0|x1)Epθ(y0|y1)[||x0 − y0||] = ||gθ\n\n1(x1) − gθ\n\n1(y1)|| ≤ K θ\n\n1 ||x1 − y1||.\n\nFor the second part, let 2 ≤ t ≤ T and xt, yt ∈ X. Since pθ(xt−1|xt) = N (xt−1; gθ\nthat sampling xt−1 ∼ pθ(xt−1|xt) is equivalent to setting\n\nt (xt), σ2\n\nt I), the reparameterization trick implies\n\nUsing the above equation, the triangle inequality, and Assumption 1, we obtain\n\nxt−1 = gθ\n\nt (xt) + σtϵt, with ϵt ∼ N (0, I).\n\nEpθ(xt−1|xt)Epθ(yt−1|yt)[||xt−1 − yt−1||]\n= Eϵt,ϵ′\n≤ Eϵt,ϵ′\n≤ K θ\n\nt (xt) + σtϵt − gθ\nt (xt) − gθ\n\nt∼N (0,I)[||gθ\nt∼N (0,I)[||gθ\n\nt ||xt − yt|| + σtEϵ,ϵ′[||ϵ − ϵ′||],\n\nt (yt) − σtϵ′\nt (yt)||] + σtEϵt,ϵ′\n\nt||]\nt∼N (0,I)[||ϵt − ϵ′\n\nt||]\n\nwhere ϵ, ϵ′ ∼ N (0, I).\n\nNext, we can use the inequalities of Lemma 3.3 to prove the following result.\n\n**Lemma 3.4.** Let T ≥ 1. The following inequality holds:\n\nEpθ(xT −1|xT )Epθ(yT −1|yT )Epθ(xT −2|xT −1)Epθ(yT −2|yT −1) . . . Epθ(x0|x1)Epθ(y0|y1)[||x0 − y0||]\n\n≤\n\n(cid:32) T\n(cid:89)\n\nt=1\n\n(cid:33)\n\nK θ\nt\n\n||xT − yT || +\n\nT\n(cid:88)\n\n(cid:32)t−1\n(cid:89)\n\nt=2\n\ni=1\n\n(cid:33)\n\nK θ\ni\n\nσtEϵ,ϵ′[||ϵ − ϵ′||],\n\nwhere ϵ, ϵ′ ∼ N (0, I).\n\n**Proof Idea.** Lemma 3.4 is proven by induction using Lemma 3.3 in the induction step.\nUsing the two previous lemmas, we obtain the following upper bound on W1(µθ\n**Lemma 3.5.** The following inequality holds:\n\nn, πθ(·)).\n\nW1(µθ\n\nn, πθ(·)) ≤\n\n1\nn\n\nn\n(cid:88)\n\n(cid:32) T\n(cid:89)\n\n(cid:33)\n\nK θ\nt\n\ni=1\n\nt=1\n\nEq(xT |xi\n\n0)Ep(yT )[||xT − yT ||] +\n\nT\n(cid:88)\n\n(cid:32)t−1\n(cid:89)\n\nt=2\n\ni=1\n\n(cid:33)\n\nK θ\ni\n\nσtEϵ,ϵ′[||ϵ − ϵ′||],\n\nwhere ϵ, ϵ′ ∼ N (0, I).\n**Proof.** Using the definition of W1, the trivial coupling, the definitions of µθ\nCombining Lemmas 3.2 and 3.5 with the triangle inequality yields Theorem 3.1.\n\nn and πθ(·), and Lemma 3.4, we get the desired result.\n\n3.3 Special case using the forward process of Ho et al. (2020)\n\nTheorem 3.1 establishes a general upper bound that holds for any forward process, as long as the backward process satisfies\nAssumption 1. In this section, we specialize the statement of the theorem to the particular case of the forward process defined in\nprevious work.\nLet X ⊆ RD. The forward process is a Gauss-Markov process with transition densities defined as\n\nwhere α1, . . . , αT is a fixed noise schedule such that 0 < αt < 1 for all t. This definition implies that at each time step 1 ≤ t ≤ T ,\n\nq(xt|xt−1) = N (xt;\n\n√\n\nαtxt−1, (1 − αt)I),\n\n5\n\n\fq(xt|x0) = N (xt;\n\n√\n\n¯αtx0, (1 − ¯αt)I), with ¯αt =\n\nt\n(cid:89)\n\ni=1\n\nαi.\n\nThe optimization objective to train the backward process ensures that for each time step t, the distribution pθ(xt−1|xt) remains close\nto the ground-truth distribution q(xt−1|xt, x0) given by\n\nq(xt−1|xt, x0) = N (xt−1; ˜µq\n\nt (xt, x0), ˜σ2\n\nt I),\n\nwhere\n\n˜µq\nt (xt, x0) =\n\n√\n\nαt(1 − ¯αt−1)\n1 − ¯αt\n\nxt +\n\n√\n\n¯αt−1(1 − αt)\n1 − ¯αt\n\nx0.\n\nNow, we discuss Assumption 1 under these definitions.\n**Remark 3.2.** We can get a glimpse at the range of K θ\npθ(xt−1|xt) is optimized to be as close as possible to q(xt−1|xt, x0).\nFor a given x0 ∼ µ, let us take a look at the Lipschitz norm of x (cid:55)→ ˜µq\n\nt for a trained DDPM by looking at the distribution q(xt−1|xt, x0), since\n\nt (x, x0). Using the above equation, we have\n\nt (xt, x0) − ˜µq\n˜µq\n\nt (yt, x0) =\n\n√\n\nαt(1 − ¯αt−1)\n1 − ¯αt\n\n(xt − yt).\n\nHence, x (cid:55)→ ˜µq\n\nt (x, x0) is K ′\n\nt-Lipschitz continuous with\n\n√\n\nK ′\n\nt =\n\nαt(1 − ¯αt−1)\n1 − ¯αt\n\n.\n\nNow, if αt < 1 for all 1 ≤ t ≤ T , then we have 1 − ¯αt > 1 − ¯αt−1, which implies K ′\nRemark 3.2 shows that the Lipschitz norm of the mean function ˜µq\nequation, we can see that for any initial x0, the Lipschitz norm K ′\nt =\nSince gθ\nnorm K ′\n\nt (·, x0) is optimized to match ˜µq\nt, we believe it is reasonable to assume gθ\n\nt < 1 for all 1 ≤ t ≤ T .\nt (·, x0) does not depend on x0. Indeed, looking at the previous\nonly depends on the noise schedule, not x0 itself.\nt (·, x0) have the same Lipschitz\n\nt is Lipschitz continuous as well. This is the intuition behind Assumption 1.\n\nt (·, x0) for each x0 in the training set, and all the functions ˜µq\n\nαt(1− ¯αt−1)\n1− ¯αt\n\n√\n\n**The prior-matching term.** With the definitions of this section, the prior matching term KL(q(xT |x0)||p(xT )) has the following\nclosed form:\n\nKL(q(xT |x0)||p(xT )) =\n\n1\n2\n\n(cid:2)−D log(1 − ¯αT ) − D ¯αT + ¯αT ||x0||2(cid:3) .\n\n**Upper-bounds on the average distance between Gaussian vectors.** If ϵ, ϵ′ are D-dimensional vectors sampled from N (0, I), then\n\nMoreover, since q(xT |x0) = N (xT ;\n\n√\n\n¯αT x0, (1 − ¯αT )I) and the prior p(yT ) = N (yT ; 0, I),\n\nEϵ,ϵ′[||ϵ − ϵ′||] ≤\n\n√\n\n2D.\n\nEq(xT |x0)Ep(yT )[||xT − yT ||] ≤ (cid:112)¯αT ||x0||2 + (2 − ¯αT )D.\n\n**Special case of the main theorem.** With the definitions of this section, the inequality of Theorem 3.1 implies that with probability\nat least 1 − δ over the randomness of {x1\n\n0, . . . , x\n\n6",
  "related_work": "",
  "methodology": "",
  "experiments": "",
  "results": "",
  "conclusion": ""
}