{
  "title": "Progress Towards Eliciting Organized Phoneme\nStructures",
  "abstract": "Phonological typology, a vital area within linguistic studies, examines the patterns\nand functions of sounds across the world’s languages. This paper offers an overview\nof completed and ongoing experiments utilizing phonological representations,\nderived from typological databases, in speech processing tasks. It primarily focuses\non two lines of inquiry motivated by the need to adapt speech technologies to low-\nresource languages and dialects. Initially, a framework is presented for evaluating\nthe cross-linguistic consistency of phonological characteristics within multilingual\nphoneme inventories. Subsequently, an outline is given for a method that could\npotentially contribute to the development of future phoneme inventory induction\nsystems, highlighting the crucial role of phonological typology in this process.",
  "introduction": "The field of phonological typology investigates the distribution and functionality of sounds in\nlanguages globally. Typological databases are instrumental in making generalizations in this domain.\nThese resources are valuable not only for creating probabilistic models of phonological typology but\nalso for enhancing downstream multilingual NLP, speech technology, and language documentation\nefforts.\n\nThis paper summarizes our research involving phonological representations in speech processing,\nutilizing phonological typology databases. Despite the prevalence of end-to-end approaches in\nautomatic speech recognition, text-to-speech, and speech-to-speech translation, the integration of\nprecise phonological knowledge remains essential in various scenarios.\n\nOur research is driven by the goal of extending speech technologies, which still rely on phonological\nrepresentations, to under-resourced languages and dialects. We first review a framework designed to\nanalyze the cross-linguistic consistency of phonological features in multilingual phoneme inventories\nobtained from cross-lingual typological databases. We then propose a preliminary method that may\nact as a foundational element in a future phoneme inventory induction system, emphasizing the\nsignificance of phonological typology in such an approach.\n\n2 Multilingual Phoneme Inventories\n\nTraditionally, a phoneme is defined as a theoretical concept specific to a single language. Applying\nphonemes and their feature encodings across languages presents a challenge: it’s unclear whether all\ndistinctive features (DFs) will be relevant or applicable in a multilingual phoneme inventory taken\nfrom a typological database. If DF representations were phonetic instead of phonemic, and acoustic\nrather than articulatory, one might anticipate a strong correlation between DFs and the acoustic\nsignal. However, in practical multilingual contexts, these representations are frequently influenced by\nphonemic considerations due to the accessibility of phonemic inventories and transcriptions.\n\nOur approach was straightforward: a phonemic contrast is deemed consistent across languages if it\ncan be reliably predicted in a binary classification task on withheld languages. This problem involves\na segment of a speech signal and a label (e.g., front vowel vs. back vowel). A classifier is trained on a\n\n\fmultilingual, multi-speaker dataset, excluding some languages for later assessment. In cases where\ncross-linguistic consistency was lacking, we enhanced the method by basing the representation on\ncontextual phonological knowledge provided as DFs, excluding the contrast being tested.\n\nOur experiments involved languages from the Dravidian, Indo-European, and Malayo-Polynesian\nfamilies, with phoneme inventories sourced from a phonological database. The results are varied. An\nexperiment designed to predict contrasts in unvoiced labial consonants between specific languages\nyielded reliable predictions across languages. Similar consistency was observed for contrasts between\nfront and back vowels, as well as vowel height and continuant manner of articulation distinctions.\nNegative outcomes include the cross-lingual prediction of retroflex consonants between language\nfamilies: a predictor trained on Dravidian languages cannot accurately predict retroflex consonants in\nanother language, and vice versa. The detection of aspiration was similarly inconsistent. Incorporating\nother contrasts as contextual features did not result in significant improvement for these complex\ncases.\n\nOur research is partly motivated by a persistent question: Can this methodology assess the cross-\nlinguistic validity of existing phoneme inventories given available data? For example, among the\nMalayo-Polynesian languages studied, only one has retroflex consonants, acquired from loanwords\nfrom other language families. Different phoneme inventories exist for this language, one of which\nincludes retroflex plosives, while another omits them. Determining which representation is superior\nin a multilingual pronunciation model remains an open issue.\n\n3 Towards Phonology Induction\n\nOur current research efforts are directed towards the induction of phoneme inventories for languages\nthat lack the standard resources needed for speech model training. This task aligns with other work\nin zero-resource subword modeling. Existing unsupervised methods for discovering acoustic units\nderive acoustic-phonetic and latent auditory-like representations, but the typological accuracy of\nthese representations is uncertain.\n\nOur initial work with \"universal\" multilingual phoneme recognizers was not successful. This was\nmainly because the limited training data and the lack of language models to guide the search frequently\nled to unreliable phoneme inventory recovery even for closely related dialects, for instance, in trying\nto identify the phoneme inventory of one dialect after being exposed to two others. An improved\nstrategy involves incorporating language identification and phonological typology into the phoneme\nrecognizer. Using an accurate language identification model, the phoneme inventories of the most\nclosely related languages can be employed to narrow down the potential phonemic hypotheses for a\nnew, previously unseen language or dialect.\n\nWe are currently adapting the phonological contrast predictor methods from the previous section for\nphonology induction tasks. Several approaches for detecting phonemic features in continuous speech\nare known, some relying solely on signal processing and others that are model-based. At a basic\nlevel, the output of such predictors represents speech as parallel, asynchronous streams of articulatory\nfeatures. More complex models that utilize the structure of articulation, feature geometry, and other\ncorrelations between features are also feasible. In these methods, cross-linguistic phonological\ndatabases are crucial for not only integrating various features into phonemes but also for validating\nwhich combinations of hypothesized phonemes are acceptable based on known phoneme inventories.\nFurthermore, additional phonological insights from other typological resources can be incorporated if\nthey can be reliably extracted from the speech signal.\n\n2",
  "related_work": "",
  "methodology": "",
  "experiments": "",
  "results": "",
  "conclusion": ""
}