{
  "title": "A 3D Convolutional Neural Network Approach for\nSustainable Architectural Design through\nComputational Fluid Dynamics Simulation and\nReverse Design Workflow",
  "abstract": "This paper introduces a versatile and flexible approximation model. This model\nis designed for the near real-time prediction of steady turbulent flow within a 3D\nenvironment. The model uses residual Convolutional Neural Networks (CNNs).\nThis methodology provides immediate feedback, enabling real-time iterations\nduring the initial stages of architectural design. Furthermore, this workflow is\ninverted, offering designers a tool that produces building volumes based on desired\nwind flow patterns.",
  "introduction": "Architectural design is inherently influenced by environmental constraints from its early conceptual\nstages. During this period, when the forms of buildings and cities are established, informed decisions\nregarding sustainable development are critically important. However, design proposals can evolve\nrapidly, making it difficult to provide relevant simulations at a comparable pace. In particular,\nComputational Fluid Dynamics (CFD) requires intricate geometry preparation and computationally\ndemanding solutions. This process is not only time-consuming but also conflicts with the speed of\ndesign iterations. To improve the integration of CFD in design processes, this work concentrates\non employing data-driven flow field predictions. It also leverages approximation using CNNs. This\napproach aims to overcome the challenges associated with traditional CFD simulations and make\nthem more accessible for iterative design processes.\n\nPrior research has shown encouraging outcomes in the rapid simulation of fluid dynamics and in\nthe approximation of the Navier-Stokes equations. We emphasize the use of CNNs with residual\nblocks in architectural contexts within 3D domains. Additionally, we explore the application of\nreverse training to forecast architectural volumes. While rapid forward prediction offers considerable\npotential for improving sustainable design, the process of using CFD analysis results to directly\ninfluence design relies on the designer’s creativity. There is no straightforward way to inform design\nchoices other than choosing the most effective design among many proposals. We address this by\nusing the same CNN model but trained in the opposite direction.\n\n2 Data Creation and Simulation\n\nUsing a visual programming language and standard Computer-Aided Design (CAD) software, several\ngeometries representing urban structure samples were produced. These samples were designed to\nreplicate common variations in building heights within a city. The widths and depths were also\nconfined to typical minimum and maximum dimensions. Each sample is represented as a 3D mesh\nand has to fit inside a space measuring 256m x 128m x 64m. These meshes are then voxelized with a\n1-meter resolution. Our dataset comprised 3500 samples in total: 3325 (95\n\n.\n\n\fIn design, analysis and optimization of aerodynamic systems, flow fields are simulated through the\nuse of CFD solvers. However, CFD simulation usually involves intensive computations, requiring\nconsiderable memory and time for each iterative step. These limitations of CFD restrict the potential\nfor design exploration and interactive design processes. Our data set was generated by employing\nOpenFOAM software. To facilitate CNN training, the entire process was automated due to the large\nnumber of cases required.\n\n3 Neural Network Architecture\n\nOur network architecture follows a U-net structure. It includes eight encoder layers and seven decoder\nlayers. Each layer integrates a residual block that contains a 3D convolution with stride 2 and 4x4x4\nfilters, along with a 3D convolution with stride 1 and 3x3x3 filters. According to our tests, these\ngated blocks improved our results. This was observed when compared to a basic encoder-decoder\narchitecture. We utilized concatenated exponential linear units for activation purposes. This fully\nconnected CNN has excellent generalization properties for geometries beyond those in the training\nset. It also works well for input data larger than the dimensions of the training samples. This network\ncan approximate wind velocity fields three orders of magnitude faster than a CFD solver in a 3D\ndomain. The test mean squared error loss showed continuous improvement across 1000 epochs for\nboth forward and reverse directions. This demonstrates the generalizability of the approach. In the\nreverse direction, we adjusted the number of output channels to 1. This represents whether a location\nis occupied by a building (1) or outside space (0). In contrast, the forward direction has 3 output\nchannels, which represent the x, y, and z components of wind direction vectors.",
  "related_work": "",
  "methodology": "",
  "experiments": "",
  "results": "We implemented a Flask server that allows for interactive prediction using the visual programming\ninterface of the common CAD software Rhino. This CAD software offers visualization capabilities\nthat were utilized to generate sample images. We present a sample of forward CFD prediction.\nThis visualizes the wind velocity magnitude (calculated using the Frobenius norm of the x, y, and\nz components). In addition, we present a reverse prediction of building volumes. Yellow indicates\nundesirably high wind speed, while blue represents low, preferable wind speed.\n\n5 Discussion\n\nRapid analysis responses are essential in the early conceptual design stages across multiple industries.\nThe demonstrated effectiveness of near real-time prediction indicates that the proposed methodology\nhas promising potential applications beyond architecture. The reverse approach directs designers to\nfocus on the desired outcome, specifically human well-being. This facilitates more efficient use of\ntime in sustainable design processes. Future research aims to improve the cost function by adding\ncontinuity equation error and implementing a generative adversarial network. We are also exploring\npossibilities for generating multiple building predictions from a single wind flow input.\n\nSupplementary Materials\n\nA Case Study\n\nWe present a designer’s workflow utilizing our forward and reverse networks. The aim is to design\nand optimize urban layouts to achieve desired wind flows. This hypothetical site has a bounding box\nwidth and depth of 256 meters, with a maximum height of 64 meters. This area is twice the size of\nour training dataset, showing the benefit of using a CNN.\n\nOur neural network is built with TensorFlow 2.0 and its Keras module. Communication between\nCAD software and TensorFlow is enabled through HTTP requests which are managed by a Flask\nserver. Currently, the pre-processing of geometry is the bottleneck, as it needs to be voxelized. This\ncan be improved in the future by using external mesh libraries.\n\n2\n\n\fA.1 Initial Sketch of Volumes\n\nInitial sketches of urban layouts can be developed in CAD software, providing a visual representation\nof the desired design and also producing an initial CFD analysis. This initial sketch step can be\nskipped, allowing a designer to directly create a point cloud of slow-wind areas (as shown in step\nA.3).\n\nA.2 Initial Interactive CFD Analysis\n\nOur forward-trained network can produce spatial CFD analysis predictions within seconds. This\nprediction is visualized in our CAD software.\n\nA.3 Thresholded and Modified CFD Analysis\n\nThe CFD is filtered to focus only on areas with lower wind speeds. These locations are better suited\nfor outdoor activities. A point cloud visualizes these locations, and this point cloud can be modified\nwith geometry transformations to achieve desired wind effects.\n\nA.4 Geometry Prediction\n\nOur reverse-trained network can predict urban volumes that will produce the required wind flow and\ncan be exported as mesh objects.\n\nA.5 Final CFD Analysis\n\nThe predicted volumes can be used to complete a CFD prediction of the wind flow.\n\nA.6 Discussion\n\nFuture research will focus on the inclusion of interior spaces. Passive cooling is a major factor\nin minimizing energy use in these spaces. The input for the reverse direction would be improved\nif pedestrian comfort, for instance, was used. Our current method only accounts for wind in one\ndirection. This works in places where a dominant wind direction exists. Areas with variable wind\ndirections would require accounting for multiple directions. The forward network is capable of\npredicting these multiple wind directions and can be combined.\n\n3",
  "conclusion": ""
}