{
  "title": "Examining the Initial Experiences of Researchers\nWhen Articulating Broader Impact",
  "abstract": "By mandating a broader impact statement with every submission for this year’s\nconference, the program chairs at the conference highlighted ethics as a crucial\ncomponent of AI research. Building on precedents from other fields and a grow-\ning awareness within the community, this paper seeks to explore how individual\nresearchers responded to this new requirement. This exploration includes their\nopinions, their experiences during the drafting process, and their reflections after\ntheir papers were accepted. We present survey results and key considerations to\ninform the next iteration of the broader impact requirement, should it continue to\nbe mandated for future conferences.",
  "introduction": "There is a growing number of unethical uses of technology. To counter this trend, some proposals\nsuggest limiting investment or procurement without impact assessment, or even calling for outright\nbans. Other proposals aim to instill ethical practices earlier in the research stage, before technology\ntransfers into products. Conferences that are typically technical have begun to host workshops on\nsocial impact issues and, in some instances, have announced more interdisciplinary subject areas.\n\nThe most significant change may be the requirement for a statement of broader impact for all\nsubmissions. Unlike workshops and interdisciplinary tracks, which might be viewed as more specific,\nthis requirement affects every submission, of which there are over 9000 this year. While broader\nimpact statements themselves are not new to the wider research community, they are new to this\nspecific community. This paper seeks to explore how individual researchers responded to the new\nrequirement, including their perspectives, their experiences and process in drafting the statements,\nand their subsequent thoughts after paper acceptances.\n\nThis research was initiated through internal discussion at our organization, which then became part\nof a broader public conversation. To collect perspectives from researchers, both within and beyond\nour organization, we developed an online public survey. The findings from this survey help to\ninform considerations for designing the next iteration of the broader impact requirement, should\nit remain a requirement for future conferences. While it is recognized that researchers are not the\nonly intended audience for these statements, and that others also have responsibilities in ethical\nresearch and technology development, researchers represent a critical mass to mobilize in this effort.\nUnderstanding the researchers’ experience and process is essential not only to the design of the\nrequirement, but also to advancing ethical research practices in general.\n\n2 Survey Method\n\nThe study employed an exploratory mixed-methods survey with both open and closed-ended questions.\nThe survey was split into two sections, one for researchers who submitted to the conference, and\nanother for those who did not. The survey was anonymous, and no demographic information was\ncollected. The survey was distributed online via research community channels and on social media.\nThe goals were to understand how researchers considered the implications of their research, how\n\n.\n\n\fthey defined their impact statements, and to understand their opinions on this new submission\nrequirement. Survey questions focused on their approach to writing the statement, encountered\nchallenges, the perceived influence of the statement on the overall submission, and their views on the\nnew requirement.\n\n3 Survey Results\n\nA total of 50 participants responded to the survey, with the majority identifying as academics (72\npercent) and industry researchers (23.5 percent). There was a balanced breakdown by career stage,\nwith graduate students making up the largest group of respondents (33 percent). Among the group\nthat submitted, the majority identified their subject areas as deep learning and theory. However,\namong researchers who did not submit, deep learning and social aspects of machine learning were the\nprimary subject areas. The survey population was not compared to the overall population, though this\ncould be an area for future study. Our questions focused on the process and challenges in completing\nthe submission requirement, the perceived impact of the requirement on paper acceptances, and\nresearchers’ views on the requirement.\n\n3.1 Process and Challenges\n\nWhen asked about their approach to the broader impact statements, 83.8 percent of respondents\nindicated that they completed this part with their co-authors, without external help. The rest of\nthe participants used other approaches such as accepting support or reaching out for help. A large\nmajority spent less than 2 hours on the statement, and almost half mentioned it was not challenging to\nprepare. There were differing trends for what could make it difficult. Some viewed their theoretical\nwork as too distant from practical applications, making the exercise speculative. Others perceived\nthe requirement as a \"bureaucratic constraint\". Researchers at different stages of their career found\nthe exercise more or less challenging, but their professional domain did not appear to affect their\nexperienced difficulty with the exercise.\n\n3.2\n\nImpact on Submission\n\nAlthough it was clarified that submissions would not be rejected solely on the basis of the broader\nimpact statement, the survey explored the researcher’s perspectives on this. For researchers who\nsubmitted, over 75 percent believed the statements were not taken into consideration, yet almost\n90 percent thought it was unclear how reviewers would evaluate the statements. Even with an\nunclear evaluation process, when asked how confident they were that their statement was adequately\naddressing the requirement, 43.2 percent stated that they were either confident or very confident.\nTime spent did not seem to have an impact, since most of the respondents who spent less than an\nhour also received acceptances. Those who sought external help appeared to have a lower ratio of\nrejections, but our sample size may be too small to draw conclusive results.\n\n3.3 Framing\n\nThe survey explored researchers’ views on the requirement and its framing. Our results indicated\nthat the community was divided on how to frame the requirement; 56 percent did not agree that\nbroader impact was the right way to frame the requirement, while 44 percent did. This split was\nsimilar when compared to subject area, submitters vs. non-submitters, and academia vs. industry.\nPostdoctoral/early-career and mid-career respondents were more supportive of the requirement\nframing than students and senior researchers. There seems to be a general feeling that assessing\nbroader impact is important, but uncertainty regarding who should do it and how. Some respondents\ndescribed the requirement as \"too broad\" or said they did not feel \"qualified to address the broader\nimpact of their work.\" Some who supported the requirement found the thought process to be valuable\nand that it \"forces researchers to reflect on the impact of their research\".\n\n4\n\nIntegrating Feedback into Next Iteration of Broader Impact\n\nThe survey results inform future iterations of the broader impact requirement. When asked what\ncould have helped them most, 92 percent of respondents indicated that examples of statements\n\n2\n\n\fwould be most helpful. There will be an increasing number of examples to draw from in future\nyears. Guidelines were the second most popular request, regarding when a statement might be\napplicable or how to formulate one. This section proposes how to integrate respondent feedback\ninto future iterations: rethinking the requirement design and framing, developing greater capacity\nand confidence among researchers, and reflecting the shared responsibility of ethical research and\ntechnology development.\n\n4.1 Requirement Design\n\nIf the goal is to develop ethical research practices, there may be other approaches to achieve this\ngoal. While written statements make sense given the paper-based nature of submissions, survey\nrespondents indicated a mix of nonchalance, outright farce, or perceived burden. These attitudes\nmay have a counterproductive effect on an ethical research goal. We encourage program chairs to\nconsider mechanisms to limit that effect (e.g., an incentive for \"best\" broader impact statements).\nSuch mechanisms are important not only to manage negative effects but also to encourage researchers\nwho found the exercise valuable.\n\n4.2 Capacity Building\n\nGiven that many respondents felt they were not qualified to address the broader impact of their\nwork, workshops may help build capacity over time, and provide a space for researchers to examine\ntheir work with a more diverse group of researchers. Discussions could help develop capacity and\nconfidence, and surface overlooked impacts. Interdisciplinary collaborations could also introduce\nnew guidelines or methodologies such as the theory of change or consequence scanning.\n\n4.3 Shared Responsibility\n\nRecognizing how different systems and social contexts interact would increase the quality of the\ndiscussion on broader impact, and develop a sense of shared responsibility for ethical research and\ntechnology development. Researchers are a critical mass, but others such as conference organizers,\ninstitutions, funders, and users also have roles and responsibilities. To address concerns around\nburden and expertise, the assessment of broader impact could be more of a multi-stakeholder exercise.",
  "related_work": "",
  "methodology": "",
  "experiments": "",
  "results": "",
  "conclusion": "This paper and its underlying survey investigated how researchers approached the broader impact\nstatement and surfaced considerations to better design this requirement in future years. While the\nsurvey represented a small sample of the community, its results demonstrate a division regarding\nhow the requirement is framed. Initiating a conversation about broader impact is itself a step towards\nestablishing norms and best practices for ethical research. We encourage further work to monitor the\nevolution of researcher’s perspectives, not only at top conferences, but also at-large.\n\n6 Acknowledgements\n\nThe authors thank Noémie Lachance, Tara Tressel, and the Research Group for their support and\nparticipation throughout this project.\n\n7 Supplementary Material\n\nThe survey questions and the responses received are available for further investigation and use. The\nsurvey remains open to responses. At the time of writing, we had 50 responses which were used for\nthe analysis in this paper.\n\n3"
}