{
  "title": "A Collaborative Painting Experience:\nHuman-Machine Interaction on Canvas",
  "abstract": "We introduce a novel approach to human-machine interaction, framed as a pictorial\ngame where artists and a computer collaborate in iterative creative rounds. The\ncomputer uses machine learning to partially complete the artwork at each stage,\nprojecting its additions directly onto the canvas, which the artists are then able to\nmodify or incorporate. This process encourages creative exploration and provokes\nquestions about the growing relationship between humans and machines.",
  "introduction": "The ongoing technological advancements are reshaping human-machine interaction, providing new\ntools for artistic creation while simultaneously prompting contemplation on their effects on human\ncreativity.\n\nGenerative Adversarial Networks (GANs) have demonstrated the creative abilities of neural networks,\nproducing aesthetically full paintings. However, in these instances, humans serve as either engineers\nor curators. Our work introduces a new method of machine utilization, integrating it into the core of\nhuman creative processes. While painting, this approach presents humans with different paths and\nconcepts for their artwork. This concept is approached through a unique interactive framework.\n\nThe artist duo Tina and Charly have previously investigated interaction through canvas art. To initiate\ntheir creative work, they select a theme and depict it in dark colors on a white canvas. They then\nstart their game. At each round, using a vocabulary of strokes and symbols, Charly anticipates Tina’s\nemotions and thoughts in red, before responding with green strokes on the painting. These rounds\ncontinue until both artists reach an agreement on finishing the painting. The entire process unfolds in\nsilence, with the canvas serving as the sole medium of dialogue.\n\nThe purpose of our work is to introduce artificial intelligence as a third participant in Tina and\nCharly’s dialogue. The AI initially captures a raw representation of the painting, then processes it to\npartially complete the work in progress, which it projects back onto the canvas. The artists then have\nthe freedom to incorporate the machine’s suggestion in blue, a color that has not been assigned to\neither player. The use of different colors allows for the analysis of each player’s contributions.",
  "related_work": "",
  "methodology": "The engineered system includes a camera and a projector connected to a computer on a support. At\neach computer round, the system captures an image of the painting and analyzes it to extract the\ncanvas strokes. This pre-processing is made robust to changes in lighting, ensuring that the interaction\ncan be used seamlessly in any studio. These strokes then feed into a neural sketcher, which produces\nnew strokes to be added to the painting. Post-processing is used to project those additions back onto\nthe canvas.\n\nThe neural sketcher is a recurrent neural network, based on a recent improvement to the seminal work\nof previous research. It is trained using a sequence of points and a channel encoding for stroke breaks.\nThe sketcher produces a similar series, which is then converted back into strokes on the original\n\n.\n\n\fpainting. The network was trained using the QuickDraw data set, enabling it to create human-like\nstrokes. For integration with Tina and Charly’s style, the learning was refined using a sketch database\nfrom previous paintings by the artists.\n\n3 Discussion\n\nThe artists found the machine strokes to be surprising and suggestive of movements they would not\nhave made on their own. Some painters have previously expressed how unintended strokes can be\nevocative. Our installation, where the machine projects completions without physically painting, and\nthe generative network capabilities, allows this to be explored. Furthermore, the ability to change\nparameters, such as the learning data set, provides the artist with more control over their usage of the\nmachine.\n\nOur interactive installation can be used by anyone and aims to raise awareness and initiate thought\nabout the interplay between humans and machines. This work highlights the need to make machines\nhuman-friendly, while also acknowledging how technology changes human behaviors and routines.\nTina and Charly felt like they were interacting with a full-body system, which had been designed\nto simulate human-like painting. They experienced the machine as sometimes restricting, hard to\nunderstand, and sometimes magical. It infused new dimensions into the painting. The feeling that the\nmachine could be collaborative or limiting is an echo of the role of technologies in our daily lives.\n\nFrom an outsider’s perspective, the machine changes their original painting style, both in the short\nterm artworks (as seen in Figure 2), and on their long-term body of work, inspiring their machine-free\npaintings. Even though we have made the machine’s influence explicit with its blue contributions, the\ninteraction is not neutral.\n\n4 Acknowledgments\n\nThe authors would like to thank Yana Hasson and Yann Labbé for coding insights, Erwan Kerdreux\nfor art history discussions, and Thomas Lartigue for general discussions.\n\n2",
  "experiments": "",
  "results": "",
  "conclusion": "",
  "is_publishable": 1,
  "venue": NaN
}