{
  "title": "Short-Term Forecasting of Precipitation Using Satellite Data",
  "abstract": "Short-range forecasting of rain or snow, known as precipitation nowcasting, is typically displayed on geographical\nmaps by weather services for up to a 2-hour timeframe. Current methods for precipitation nowcasting predomi-\nnantly use the extrapolation of ground-based radar observations, employing techniques like optical flow or neural\nnetworks. However, the effectiveness of these methods is geographically restricted to areas surrounding radar\ninstallations. This paper introduces a novel precipitation nowcasting technique that utilizes geostationary satellite\nimagery. This method has been integrated into the Yandex.Weather precipitation map, which includes an alert\nsystem with push notifications for Yandex ecosystem products. The integration of satellite imagery significantly\nbroadens the coverage area, marking a step towards developing a comprehensive global nowcasting service.",
  "introduction": "Weather conditions significantly impact the daily routines and planning of urban populations. Similar to how ancient humans\nrelied on environmental cues for hunting, modern individuals adjust their daily and leisure activities based on the likelihood of\nrain or cloud cover. Weather forecasting services provide essential data, including temperature, precipitation intensity and type,\ncloudiness, humidity, pressure, and wind conditions. These services offer current weather updates, short-term predictions up to 2\nhours (nowcasting), medium-range forecasts up to 10 days, and long-range predictions spanning several months.\n\nA crucial component of weather services is the precipitation map, which combines radar data with neural network-based, very\nshort-term precipitation forecasting to deliver a detailed map of anticipated precipitation for the next two hours, updated every 10\nminutes. This feature enables personalized, user-friendly notifications, such as alerts about impending rain. The popularity of this\nfeature is evident, as it significantly influences user engagement and reliance on weather services.\n\nThe information from the precipitation map is used to refine current weather condition reports (e.g., sunny, cloudy, rainy) on the main\nweather website. Additionally, partners and offline users, including radio and television, depend on this data, effectively doubling the\naudience for the precipitation nowcasting product.\n\nTraditional weather forecasting, which involves numerical modeling of the atmosphere, cannot accurately predict exact rain locations\non short time scales. For instance, it struggles to determine which part of a city will be affected by rain within the next hour.\nMoreover, traditional methods provide hourly updates, making it difficult to pinpoint brief periods without rain during short, intense\nprecipitation events. People often need straightforward answers to simple questions like when it will rain or stop raining, requiring\nspecific predictions such as \"heavy rain will start in 10 minutes and last for 30 minutes.\"\n\nConventional numerical weather prediction (NWP) models are limited in their ability to forecast precipitation events at specific\nlocations and times. Radar extrapolation products are effective for the first couple of hours but fail to predict precipitation accurately\ndue to physical processes. Consequently, the current trend in nowcasting is to merge high-resolution radar data with traditional NWP\nmodels.\n\nHowever, radar-based products are limited by the location of radar installations and are not easily scalable. Radars are costly, their\ninstallation requires governmental and public approval, and their operation needs trained personnel. Coverage is particularly sparse\nin large, unevenly populated countries like Russia, where many remote areas lack the necessary infrastructure. Similar challenges\nexist in many developing countries that need weather services but lack the infrastructure for radar networks.\n\nThe objective of this research is to develop and implement a practical system for precipitation nowcasting that relies on satellite\nimagery and NWP products. The goal is to replicate the precipitation fields obtained from radar using satellite data and then to\nprovide nowcasting over a much larger area using a similar predictive model. The system’s effectiveness is validated by comparing\npredicted precipitation with data from ground-based weather stations. The primary focus areas with limited radar coverage are the\nSiberian and Ural federal districts of Russia, which have a combined population of approximately 30 million.",
  "related_work": "This section provides an overview of related work, divided into two main parts corresponding to the primary components of our\npipeline.\n\n2.1 Precipitation detection\n\nThe global and continuous coverage offered by geostationary satellite imagery makes it a highly desirable data source for precipitation\nnowcasting algorithms. Since satellites do not directly observe rainfall, precipitation data must be extracted using heuristic or\nmachine learning methods. This extraction can be framed as either precipitation estimation (regression) or precipitation detection\n(binary classification). This paper concentrates on the binary classification approach to precipitation detection.\n\nThe interaction of light with the atmosphere, specifically absorption and scattering, is governed by established physical principles.\nThese principles can be used to develop heuristics for detecting precipitation. One such implementation is the multi-sensor\nprecipitation estimate (MPE), which is, however, limited to detecting convective rain and may produce inaccurate results in\nareas with other forms of precipitation. This limitation is particularly significant in middle and high latitudes, where convective\nprecipitation is predominantly a summer phenomenon resulting from surface heating, leading to the formation of cumulonimbus\nclouds and heavy rainfall. During much of the year, frontal precipitation, driven by cyclonic movements and interactions between\nwarm and cold fronts, is more common. The MPE algorithm often fails to capture these frontal precipitation events.\n\nA more advanced physics-based heuristic is the precipitation properties (PP) algorithm, which integrates NWP model data, cloud\nphysical properties, and satellite measurements. This algorithm uses radar observations to calibrate its parameters. However, because\nit relies on satellite observations at visible wavelengths to determine cloud properties, it can only retrieve precipitation data during\ndaylight hours.\n\nMachine learning techniques, including decision trees, neural networks, and SVMs, have been evaluated for precipitation detection.\nHowever, these studies often used pixel-wise data splits for training and testing, which may lead to overfitting due to neglecting\nthe spatial and temporal smoothness of atmospheric phenomena. While these studies examined day, twilight, and night conditions\nseparately, with the best results during the day, a more sophisticated method using a fully-connected stacked denoising autoencoder\nhas also been applied to precipitation detection. Although the autoencoder’s unsupervised training helps mitigate overfitting, there is\nno comparison with other architectures.\n\nFrom a machine learning perspective, precipitation detection is similar to semantic segmentation, where a multichannel image is\ninput, and each pixel is assigned an output label. Convolutional neural networks have become the standard for semantic segmentation\nin recent years, making them a natural choice for precipitation detection as well.\n\nConvolutional neural networks have been effectively used in various satellite image processing tasks, such as road and building\ndetection. Despite numerous public challenges that have advanced the field, the range of architectures used for aerial image\nprocessing remains narrower compared to those used for semantic segmentation datasets like Microsoft COCO or Cityscapes. A\ncommon issue in these datasets is the presence of objects of the same class at different scales, which has led to the development\nof multiscale approaches. However, these approaches are less applicable to precipitation detection and other satellite imagery\ntasks, as the distance between the sensor and the Earth’s surface is usually known. Consequently, simpler models like UNet and\nfully-convolutional ResNet remain relevant.\n\n2.2 Nowcasting\n\nPrecipitation nowcasting is typically accomplished in two stages by extrapolating radar observations. Initially, wind patterns are\nestimated by comparing multiple precipitation fields captured by radar. The techniques used for this in meteorology are similar to\noptical flow estimation algorithms in computer vision. Subsequently, the precipitation field is moved according to the estimated\nwind directions.\n\nA novel approach to nowcasting using a convolutional recurrent neural network (Conv-LSTM) was introduced and later refined.\nWhile this neural network adds complexity, it can theoretically improve rainfall prediction accuracy by accounting for radar artifacts\nand the appearance or disappearance of precipitation areas. However, the most significant of these processes, the vanishing of\nprecipitation, can also be managed by adding basic filtering to the optical flow method.",
  "methodology": "This section details the methodology used for precipitation detection and nowcasting, focusing on data preprocessing, model training,\nand evaluation metrics.\n\n2\n\n\f3.1 Data Sources\n\nPrecipitation nowcasting imposes distinct data requirements compared to Numerical Weather Prediction (NWP), including high\nspatial and temporal resolution, direct rainfall measurement, and global coverage. Since no single source can fulfill all these\nrequirements, it is necessary to combine multiple data sources.\n\nWeather stations provide direct precipitation observations, typically measuring accumulated precipitation every 12 hours according\nto the SYNOP protocol. Although many stations report more frequently, usually every 3 hours, this frequency is insufficient for\nnowcasting due to the lack of detailed spatial and temporal data needed to generate high-resolution precipitation fields.\n\nRadar observations are the primary source of high-resolution precipitation data. The Russian network of DMRL-C radars, operated\nby Roshydromet, uses C-band Doppler technology to measure raindrop reflectivity and radial velocity. Each radar covers a circular\narea with a radius of up to 250 km and 10 km above the ground, with accuracy diminishing with distance. The radar echo can be\nconverted to surface precipitation using the Marshall-Palmer relation. The resulting precipitation field has a resolution of 2 x 2 km,\nwith scans repeated every ten minutes. However, radar coverage is limited, especially outside densely populated areas of Europe and\nNorth America, with most Russian radars located in the western part of the country.\n\nLow Earth orbit satellites equipped with radars and sensors provide another source of precipitation measurements. These satellites\nscan a narrow band beneath their orbital path, offering global coverage in the sense that every location within a certain latitude range\nis eventually scanned. However, the time between consecutive passes of a single satellite can be quite long. The Global Precipitation\nMeasurements (GPM) mission, operated by NASA and JAXA, uses a constellation of about 10 operational satellites to provide\nglobal precipitation coverage from 65°S to 65°N with a 3-hour temporal resolution.\n\nGeostationary satellites are widely used for weather observation. Positioned 35,786 km above the equator, these satellites match the\nEarth’s rotation, allowing continuous monitoring of a large area. However, at such altitudes, the only feasible instrument for cloud\nand precipitation detection is a high-resolution imager that captures visible and infrared spectrum snapshots. Accurately detecting\nprecipitation from these images is challenging. Previous studies on this topic have not achieved the accuracy needed for user-facing\nproducts that aim to alert users about precipitation within 10 minutes.\n\nThis study uses data from the Meteosat-8 satellite, operated by EUMETSAT, positioned over the Indian Ocean at 41.5° longitude,\ncovering the western part of Russia and Europe. The SEVIRI instrument on Meteosat-8 scans the Earth’s surface in 12 channels,\nwith a spatial resolution of 3 km per pixel and a full scan time of 15 minutes.\n\nThis paper describes a precipitation nowcasting system that integrates radar, satellite, and NWP model data. A new approach to\nprecipitation detection is introduced and its accuracy is demonstrated.\n\n3.2 Precipitation Detection\n\nThe approach to precipitation detection is summarized in Table 1. The key components of the pipeline are described in detail in the\nfollowing subsections.\n\nTable 1: Summary of our precipitation detection approach.\n\nInput features\nGround truth\nModel\nLoss function\nEvaluation measure\n\nSatellite imagery, GFS fields, solar altitude, topography\nBinarized radar measurements\nUNet\nBinary crossentropy + Dice loss\nF1 score\n\n3.2.1 Preprocessing\n\nThe data preparation process involves several steps aimed at minimizing the discrepancies between different data domains.\n\nRadar data preprocessing begins by discarding radar observations taken beyond 200 km from the radar, as these are deemed\nunreliable. Subsequently, observations from various radars are consolidated onto a single map, resolving any conflicts between\nradars with overlapping coverage areas. Due to frequent false negatives in radar observations, the maximum value between two data\npoints is used for aggregation. Finally, radar observations are binarized using three thresholds: 0.08 mm/h for light rain, 0.5 mm/h\nfor moderate rain, and 2.5 mm/h for heavy rain.\n\nSatellite images and radar observations are remapped onto a uniform grid using an equirectangular projection. Given the oblique\nobservation angles and the fact that precipitation can occur up to 2 km above the ground, there can be a parallax shift of up to 3\npixels between radar and satellite data. However, in practice, accurately estimating precipitation height is complex, and accounting\nfor parallax did not improve the alignment.\n\nSatellite and radar data have different observation frequencies: satellite images are available every 15 minutes, while radar images\nare available every 10 minutes. To align these data sources temporally, a frame rate conversion is implemented using optical\nflow interpolation. The goal is to match the radar data’s temporal resolution, so satellite data is converted to a 10-minute time\n\n3\n\n\fstep. However, optical flow cannot be directly computed from satellite imagery due to the presence of both transient atmospheric\nphenomena and the permanent underlying relief. This issue is circumvented by performing precipitation detection before the optical\nflow step, allowing the optical flow to be computed directly from the precipitation detection results, which do not include the relief.\n\nTo generate the missing image It between two adjacent anchor images taken at times t0 and t1, the following equation is used:\n\nIt(r) = aIt0(r + bu01) + bIt1 (r + au10)\n\nwhere a = t1−t\nt1−t0\nbackward optical flows, computed using the TV-L1 optical flow algorithm implemented in OpenCV.\n\nare coefficients dependent on the time of the generated image, and u01 and u10 are the forward and\n\nand b = t−t0\nt1−t0\n\nRoshydromet radars record the timestamp at the end of a scan, whereas EUMETSAT marks the start. Since the Earth is scanned in a\nseries of lateral sweeps starting from the south, the actual observation time varies with latitude, with northern latitudes observed\nlast. The combined discrepancy between timestamps can reach 20 minutes. Experimental validation has confirmed that this value\ncorresponds to the minimum discrepancy between radar data and precipitation field reconstruction.\n\nAdditional features are incorporated into the satellite imagery to enhance the signal. The Global Forecast System (GFS) model\nis used to provide a comprehensive description of atmospheric conditions, including physical properties not easily inferred from\nsatellite imagery. The GFS model produces forecasts four times a day with a spatial resolution of 0.25° x 0.25° and temporal\nintervals of 3 hours. Key fields from GFS include convective precipitation rate, cloud work function, cloud water, precipitable water,\nand convective potential energy at different levels. Additionally, a topography map and solar altitude data are included as features.\n\n3.2.2 Training\n\nA modified UNet architecture is employed as the primary model for precipitation detection. Through testing, it was determined\nthat using 5 upsample/downsample blocks, compared to the original 4, yields the best results on the validation dataset. The model\nutilizes standard 3x3 convolutions, 2x2 pooling, and batch normalization layers. The number of channels begins at 16 in the first\nblock and doubles with each downsampling step. This reduced number of channels helps mitigate overfitting and accelerates training\nand evaluation.\nThe network is trained for 250,000 iterations using the Adam algorithm, with an initial learning rate of 10−4, which is reduced by a\nfactor of 10 after 200,000 iterations. The addition of the Dice loss to the standard binary cross-entropy improves the F1 scores for\nthe converged model. Training is performed using the Keras framework with a TensorFlow backend and Horovod for multi-GPU\nlearning.\n\nThe model is trained to detect three levels of precipitation (light, medium, and heavy) simultaneously, producing three output maps\nwith binary classification loss applied to each map independently.\n\nTypically, precipitation estimation algorithms are developed separately for day, twilight, and night conditions. However, this\nseparation is challenging for machine learning in high-latitude zones due to the underrepresentation of night during summer and day\nduring winter, making it difficult to compile a balanced dataset. Therefore, a single model is trained, with solar altitude provided as\nan additional input feature.\n\nOverfitting is a significant concern due to the limited geographical area of the dataset. The network can easily memorize the relief,\nwhich is visible in some wavelengths even if not explicitly provided as a feature, and use it to overfit on ground truth labels within\nthe radar coverage areas. Moreover, memorizing the correspondence between geographical location and output labels may cause the\nmodel to ignore areas outside radar coverage, leading to constant output in these regions. This contradicts the goal of extending\nnowcasting beyond radar coverage. To address this, the model is trained on relatively small data crops (96x96 pixels).\n\nDue to the large number of channels in the input data, which is atypical for computer vision problems, data loading can be slow. To\nmanage this, a small batch of 5 multi-channel images (including all additional features) is loaded, and each image is then cropped 10\ntimes at random locations.\n\n3.2.3 Metrics\n\nThis section presents the evaluation metrics for the precipitation detection algorithm. Due to class imbalance, standard classification\naccuracy is not informative. Therefore, the primary metric used is the F1 score, averaged across temporal and spatial dimensions.\n\nSeveral approaches are compared:\n\n- **UNet with GFS**: The UNet architecture with a complete set of features, trained as described earlier. - **UNet w/o GFS**: The\nsame UNet approach without GFS features. - **Pointwise**: A neural network with two convolutional layers using 1x1 convolutions,\nequivalent to a pointwise perceptron model. GFS features are not used in this model. - **PP and MPE**: Physics-based algorithms\n(Precipitation Properties and Multi-sensor Precipitation Estimate).\n\nGiven that PP and MPE algorithms are designed for daylight conditions, the metrics are also averaged separately for day, night, and\ntwilight periods. The neural network approaches consistently outperform the physics-based methods across all time periods and\nmetrics. The generally poor performance of PP and MPE in these experiments may be due to their tuning for predicting convective\nrainfall aggregated over extended periods, which does not align with the requirements of this service.\n\n4\n\n\fThe pointwise model’s performance falls between that of UNet and the physics-based approaches. Since it is trained on radar data, it\ndetects similar types of precipitation and performs well during testing.\n\nThe UNet architecture’s superiority over the pointwise model likely stems from its ability to gather information from a large\nreceptive field. While precipitation reconstruction does not require the same extent of multiscale data processing as many semantic\nsegmentation tasks, the interconnectedness of adjacent atmospheric locations makes a large receptive field beneficial for precipitation\ndetection.\n\nFinally, the addition of GFS features further enhances the F1 score of the UNet model, as demonstrated in the results.",
  "experiments": "4.1 Nowcasting\n\nUpon completing the reconstruction of the precipitation field in the area of interest, a separate algorithm is employed to forecast future\nprecipitation fields based on several consecutive reconstructed fields. Two options are considered for this algorithm: extrapolation\nwith optical flow, as used for frame rate conversion, and a convolutional neural network previously developed for radar data\nprediction. The network consists of a sequence of blocks, each modeling the extrapolation process with optical flow via a spatial\ntransformer layer. Although the neural network’s prediction mechanism is intentionally similar, end-to-end learning on real data\ntheoretically allows it to surpass the performance of simpler algorithms. While the neural network approach was found to be superior\nin the single radar setting, preliminary experiments did not show the same success with composited radar images and satellite data.\nDespite the optical flow approach being simpler and not requiring retraining with the introduction of new data sources, it is believed\nthat neural nowcasting remains promising and could outperform simpler techniques with proper tuning of the network architecture\nand training regimen.",
  "results": "5.1 Post-Launch Performance\n\nAlthough the satellite-based rain detection model was trained to match radar fields, its reception by users was uncertain. A/B testing\nalone was insufficient to evaluate the product’s performance, as it was essentially a new feature for several regions of Russia and\ncould be well-received initially even if the map quality was low. Therefore, the performance of the new precipitation map was\nassessed using ground station data. While the optimal metrics for a user-facing precipitation prediction algorithm are still debated,\nthere was evidence of the nowcasting product’s popularity, and the aim was to replicate the properties of the radar-based precipitation\nmap using satellite data. Specifically, the radar data differs from longer-term forecasts based on proprietary Meteum technology in\nhaving higher accuracy and lower systematic error rates (precipitation imbalance) at the cost of a lower F1 score when compared to\nground station weather observations. The same comparison strategy was used to evaluate the performance of the new satellite-based\nrain detection algorithm over the federal districts of Russia. Results showed that while the accuracy of the satellite-based product is\nlower than that of radar, it is still better than traditional forecasts, with precipitation imbalance and F1 scores similar to those for\nradar. It is important to note that the radar located in Siberia was used only for verification at this stage; its data was not included in\nthe training dataset. This comparison allows for evaluating precipitation detection quality in regions without radar observation.\n\nThis result confirmed the success of the new rain map. Additionally, A/B testing on users showed a statistically significant increase\nin daily active users (DAU) in areas where the rain map was previously unavailable (Siberia and Ural regions), justifying its rollout\nin late September.\n\nTable 2: Comparison of precipitation detection methods with various metrics averaged over time.\n\nMethod\n\nAccuracy\n\nF1 Score\n\nPrecision Recall\n\nMPE\nPP\nPointwise\nU-Net w/o GFS\nU-Net with GFS\n\n0.92\n0.86\n0.91\n0.94\n0.94\n\n0.21\n0.30\n0.48\n0.56\n0.60\n\n0.28\n0.24\n0.40\n0.64\n0.62\n\n0.17\n0.40\n0.61\n0.50\n0.59",
  "conclusion": "A precipitation nowcasting system has been developed, implemented, and launched, utilizing both ground-based radar observations\nand geostationary satellite imagery. The system employs advanced machine learning algorithms and incorporates the physical\nproperties of the atmosphere and ground surface based on NWP models. The inclusion of satellite data enables nowcasting for areas\nnot covered by ground-based radars, achieving quality comparable to traditional radar-based nowcasts.\n\n5\n\n\fTable 3: Comparison of F1 scores of precipitation detection methods during different time periods.\n\nMethod\n\nMPE\nPP\nPointwise\nU-Net w/o GFS\nU-Net with GFS\n\nDay\n\n0.19\n0.32\n0.54\n0.65\n0.67\n\nTwilight Night All\n\n0.22\n0.31\n0.48\n0.55\n0.60\n\n0.21\n0.27\n0.41\n0.49\n0.54\n\n0.21\n0.30\n0.48\n0.56\n0.60\n\nCurrently, the system is limited to the region centered on European Russia within the Meteosat-8 field of view. Compared to previous\nsolutions, the potential audience has been expanded from approximately 70 million to 300 million people, based on coverage area\nand population density. The approach can be extended to the rest of the Meteosat-8 coverage area. Scaling the technology to other\ngeostationary satellites with similar measurement systems, such as Himawari and GOES, offers the possibility of providing global\nprecipitation nowcasting and alerting services worldwide. However, differences in weather patterns across geographical regions will\nlikely necessitate retraining the detection model and adjusting the set of input features.\n\nOne encountered problem is the sharp edge between radar and satellite data. This stationary edge on the weather map can confuse\nusers, indicating the need for more sophisticated data fusion techniques. Experiments with image blending to erase conflicting\nobservations along the border and inpainting the missing parts have been conducted.\n\n7 Acknowledgments\n\nThe success of this work and the product is attributed to the support, assistance, and hard work of a large team. Although not all team\nmembers could be included as co-authors, their contributions are gratefully acknowledged. Key contributions include data delivery,\nprocessing, and merging of satellite and radar images; preliminary assessment of satellite algorithms; backend tile generation for\nprecipitation maps; API support; and development of radar-based nowcasting algorithms used as a baseline. Special thanks are\nextended to the ML, backend, frontend, testing, design, and mobile application teams, and all supporters of the project.\n\n6",
  "is_publishable": 1,
  "venue": NaN
}