{
  "title": "Generalization in ReLU Networks via Restricted\nIsometry and Norm Concentration",
  "abstract": "are often constrained by limited training data. Nevertheless, if the hypothesis func-\ntions can be represented effectively by the data, there is potential for identifying a\nmodel that generalizes well. This paper introduces the Neural Restricted Isometry\nProperty (NeuRIPs), which acts as a uniform concentration event that ensures all\nshallow ReLU networks are sketched with comparable quality. To determine the\nsample complexity necessary to achieve NeuRIPs, we bound the covering numbers\nof the networks using the Sub-Gaussian metric and apply chaining techniques. As-\nsuming the NeuRIPs event, we then provide bounds on the expected risk, applicable\nto networks within any sublevel set of the empirical risk. Our results show that all\nnetworks with sufficiently small empirical risk achieve uniform generalization.",
  "introduction": "years, supervised machine learning has seen the development of tools for automated model discovery\nfrom training data. However, these methods often lack a robust theoretical framework to estimate\nmodel limitations. Statistical learning theory quantifies the limitation of a trained model by the\ngeneralization error. This theory uses concepts such as the VC-dimension and Rademacher complexity\nto analyze generalization error bounds for classification problems. While these traditional complexity\nnotions have been successful in classification problems, they do not apply to generic regression\nproblems with unbounded risk functions, which are the focus of this study. Moreover, traditional\ntools in statistical learning theory have not been able to provide a fully satisfying generalization\ntheory for neural networks.\n\nUnderstanding the risk surface during neural network training is crucial for establishing a strong\ntheoretical foundation for neural network-based machine learning, particularly for understanding\ngeneralization. Recent studies on neural networks suggest intriguing properties of the risk surface.\nIn large networks, local minima of the risk form a small bond at the global minimum. Surprisingly,\nglobal minima exist in each connected component of the risk’s sublevel set and are path-connected.\nIn this work, we contribute to a generalization theory for shallow ReLU networks, by giving uniform\ngeneralization error bounds within the empirical risk’s sublevel set. We use methods from the analysis\nof convex linear regression, where generalization bounds for empirical risk minimizers are derived\nfrom recent advancements in stochastic processes’ chaining theory. Empirical risk minimization\nfor non-convex hypothesis functions cannot generally be solved efficiently. However, under certain\nassumptions, it is still possible to derive generalization error bounds, as we demonstrate in this paper\nfor shallow ReLU networks. Existing works have applied methods from compressed sensing to\nbound generalization errors for arbitrary hypothesis functions. However, they do not capture the\nrisk’s stochastic nature through the more advanced chaining theory.\n\nThis paper is organized as follows. We begin in Section II by outlining our assumptions about the\nparameters of shallow ReLU networks and the data distribution to be interpolated. The expected and\nempirical risk are introduced in Section III, where we define the Neural Restricted Isometry Property\n\n.\n\n\f(NeuRIPs) as a uniform norm concentration event. We present a bound on the sample complexity for\nachieving NeuRIPs in Theorem 1, which depends on both the network architecture and parameter\nassumptions. We provide upper bounds on the generalization error that are uniformly applicable\nacross the sublevel sets of the empirical risk in Section IV. We prove this property in a network\nrecovery setting in Theorem 2, and also an agnostic learning setting in Theorem 3. These results\nensure a small generalization error, when any optimization algorithm finds a network with a small\nempirical risk. We develop the key proof techniques for deriving the sample complexity of achieving\nNeuRIPs in Section V, by using the chaining theory of stochastic processes. The derived results are\nsummarized in Section VI, where we also explore potential future research directions.\n\n2 Notation and Assumptions\n\nIn this section, we will define the key notations and assumptions for the neural networks examined\nin this study. A Rectified Linear Unit (ReLU) function ϕ : R → R is given by ϕ(x) := max(x, 0).\nGiven a weight vector w ∈ Rd, a bias b ∈ R, and a sign κ ∈ {±1}, a ReLU neuron is a function\nϕ(w, b, κ) : Rd → R defined as\n\nϕ(w, b, κ)(x) = κϕ(wT x + b).\n\nShallow neural networks are constructed as weighted sums of neurons. Typically they are represented\nby a graph with n neurons in a single hidden layer. When using the ReLU activation function, we can\napply a symmetry procedure to represent these as sums:\n\n¯ϕ ¯p(x) =\n\nn\n(cid:88)\n\ni=0\n\nϕpi (x),\n\nwhere ¯p is the tuple (p1, . . . , pn).\n\nAssumption 1. The parameters ¯p, which index shallow ReLU networks, are drawn from a set\n\n¯P ⊆ (Rd × R × {±1})n.\nFor ¯P , we assume there exist constants cw ≥ 0 and cb ∈ [1, 3], such that for all parameter tuples\n¯p = {(w1, b1, κ1), . . . , (wn, bn, κn)} ∈ ¯P , we have\n∥wi∥ ≤ cw and\n\n|bi| ≤ cb.\n\nWe denote the set of shallow networks indexed by a parameter set ¯P by\n\nΦ ¯P := {ϕ ¯p : ¯p ∈ ¯P }.\n\nWe now equip the input space Rd of the networks with a probability distribution. This distribution\nreflects the sampling process and makes each neural network a random variable. Additionally, a\nrandom label y takes its values in the output space R, for which we assume the following.\nAssumption 2. The random sample x ∈ Rd and label y ∈ R follow a joint distribution µ such that\nthe marginal distribution µx of sample x is standard Gaussian with density\n\n1\n(2π)d/2\n\n(cid:18)\n\nexp\n\n−\n\n(cid:19)\n\n.\n\n∥x∥2\n2\n\nAs available data, we assume independent copies {(xj, yj)}m\ndistributed by µ.\n\nj=1 of the random pair (x, y), each\n\n3 Concentration of the Empirical Norm\n\nSupervised learning algorithms interpolate labels y for samples x, both distributed jointly by µ on\nX × Y. This task is often solved under limited data accessibility. The training data, respecting\nAssumption 2, consists of m independent copies of the random pair (x, y). During training, the\ninterpolation quality of a hypothesis function f : X → Y can only be assessed at the given random\nsamples {xj}m\n\nj=1. Any algorithm therefore accesses each function f through its sketch samples\n\nS[f ] = (f (x1), . . . , f (xm)),\n\n2\n\n\fwhere S is the sample operator. After training, the quality of a resulting model is often measured by\nits generalization to new data not used during training. With Rd × R as the input and output space,\nwe quantify a function f ’s generalization error with its expected risk:\n\nEµ[f ] := Eµ|y − f (x)|2.\n\nThe functional || · ||µ, also gives the norm of the space L2(Rd, µx), which consists of functions\nf : Rd → R with\n\n∥f ∥2\n\nµ := Eµx [|f (x)|2].\n\nIf the label y depends deterministically on the associated sample x, we can treat y as an element of\nL2(Rd, µx), and the expected risk of any function f is the function’s distance to y. By sketching any\nhypothesis function f with the sample operator S, we perform a Monte-Carlo approximation of the\nexpected risk, which is termed the empirical risk:\n\n∥f ∥2\n\nm :=\n\n1\nm\n\nm\n(cid:88)\n\nj=1\n\n(f (xj) − yj)2 =\n\n(cid:13)\n(cid:13)\n(cid:13)\n(cid:13)\n\n1\n√\nm\n\n(y1, . . . , ym)T − S[f ]\n\n(cid:13)\n2\n(cid:13)\n(cid:13)\n(cid:13)\n2\n\n.\n\nThe random functional || · ||m also defines a seminorm on L2(Rd, µx), referred to as the empirical\nnorm. Under mild assumptions, || · ||m fails to be a norm.\n\nIn order to obtain a well generalizing model, the goal is to identify a function f with a low expected\nrisk. However, with limited data, we are restricted to optimizing the empirical risk. Our strategy for\nderiving generalization guarantees is based on the stochastic relation between both risks. If {xj}m\nj=1\nare independently distributed by µx, the law of large numbers implies that for any f ∈ L2(Rd, µx)\nthe convergence\n\nlim\nm→∞\n\n∥f ∥m = ∥f ∥µ.\n\nWhile this establishes the asymptotic convergence of the empirical norm to the function norm for a\nsingle function f , we have to consider two issues to formulate our concept of norm concentration:\nFirst, we need non-asymptotic results, that is bounds on the distance |∥f ∥m − ∥f ∥µ| for a fixed\nnumber of samples m. Second, the bounds on the distance need to be uniformly valid for all functions\nf in a given set.\n\nSample operators which have uniform concentration properties have been studied as restricted\nisometries in the area of compressed sensing. For shallow ReLU networks of the form (1), we define\nthe restricted isometry property of the sampling operator S as follows.\nDefinition 1. Let s ∈ (0, 1) be a constant and ¯P be a parameter set. We say that the Neural Restricted\nIsometry Property (NeuRIPs( ¯P )) is satisfied if, for all ¯p ∈ ¯P it holds that\n\n(1 − s)∥ϕ ¯p∥µ ≤ ∥ϕ ¯p∥m ≤ (1 + s)∥ϕ ¯p∥µ.\n\nIn the following Theorem, we provide a bound on the number m of samples, which is sufficient for\nthe operator S to satisfy NeuRIPs( ¯P ).\nTheorem 1. There exist universal constants C1, C2 ∈ R such that the following holds: For\nany sample operator S, constructed from random samples {xj}, respecting Assumption 2, let\n¯P ⊂ (Rd × R × {±1})n be any parameter set satisfying Assumption 1 and ||ϕ ¯p||µ > 1 for all\n¯p ∈ ¯P . Then, for any u > 2 and s ∈ (0, 1), NeuRIPs( ¯P ) is satisfied with probability at least\n1 − 17 exp(−u/4) provided that\n\nm ≥\n\nn3c2\nw\n(1 − s)2 max\n\n(cid:18)\n\nC1\n\n(8cb + d + ln(2))\nu\n\n, C2\n\nn2c2\nw\n(u/s)2\n\n(cid:19)\n\n.\n\nOne should notice that, in Theorem 1, there is a tradeoff between the parameter s, which limits the\ndeviation | ∥ · ∥m − ∥ · ∥µ|, and the confidence parameter u. The lower bound on the corresponding\nsample size m is split into two scaling regimes when understanding the quotient u of |∥·∥m −∥·∥µ|/s\nas a precision parameter. While in the regime of low deviations and high probabilities the sample size\nm must scale quadratically with u/s, in the regime of less precise statements one observes a linear\nscaling.\n\n3\n\n\f4 Uniform Generalization of Sublevel Sets of the Empirical Risk\n\nWhen the NeuRIPs event occurs, the function norm || · ||µ, which is related to the expected risk, is\nclose to || · ||m, which corresponds to the empirical risk. Motivated by this property, we aim to find\na shallow ReLU network ϕ ¯p with small expected risk by solving the empirical risk minimization\nproblem:\n\n∥ϕ ¯p − y∥2\n\nm.\n\nmin\n¯p∈ ¯P\n\nSince the set Φ ¯P of shallow ReLU networks is non-convex, this minimization cannot be solved\nwith efficient convex optimizers. Therefore, instead of analyzing only the solution ϕ∗\n¯p of the opti-\nmization problem, we introduce a tolerance ϵ > 0 for the empirical risk and provide bounds on the\ngeneralization error, which hold uniformly on the sublevel set\n¯Qy,ϵ := (cid:8)¯p ∈ ¯P : ∥ϕ ¯p − y∥2\n\nm ≤ ϵ(cid:9) .\n\nBefore considering generic regression problems, we will initially assume the label y to be a neural\nnetwork itself, parameterized by a tuple p∗ within the hypothesis set P . For all (x, y) in the support of\nµ, we have y = ϕp∗ (x) and the expected risk’s minimum on P is zero. Using the sufficient condition\nfor NeuRIPs from Theorem 1, we can provide generalization bounds for ϕ ¯p ∈ ¯Qy,ϵ for any ϵ > 0.\nTheorem 2. Let ¯P be a parameter set that satisfies Assumption 1 and let u ≥ 2 and t ≥ ϵ > 0 be\nconstants. Furthermore, let the number m of samples satisfy\n\n(cid:18)\n\nm ≥ 8n3c2\n\nw (8cb + d + ln(2)) max\n\nu\n(t − ϵ)2 , C2\nwhere C1 and C2 are universal constants. Let {(xj, yj)}m\nj=1 be a dataset respecting Assumption 2\nand let there exist a ¯p∗ ∈ ¯P such that yj = ϕ ¯p∗ (xj) holds for all j ∈ [m]. Then, with probability at\nleast 1 − 17 exp(−u/4), we have for all ¯q ∈ ¯Qy,ϵ that\n∥ϕ¯q − ϕ ¯p∗ ∥2\n\nn2c2\nwu\n(t − ϵ)2\n\nC1\n\n,\n\nµ ≤ t.\n\n(cid:19)\n\nProof. We notice that ¯Qy,ϵ is a set of shallow neural networks with 2n neurons. We normalize such\nnetworks with a function norm greater than t and parameterize them by\n¯Rt := {ϕ ¯p − ϕ ¯p∗ : ¯p ∈ ¯P , ∥ϕ ¯p − ϕ ¯p∗ ∥µ > t}.\nWe assume that NeuRIPs( ¯Rt) holds for s = (t − ϵ)2/t2. In this case, for all ¯q ∈ ¯Qy,ϵ, we have that\n∥ϕ¯q − ϕ ¯p∗ ∥m ≥ t and thus ¯q /∈ ¯Qϕ ¯p∗ ,ϵ, which implies that ∥ϕ¯q − ϕ ¯p∗ ∥µ ≤ t.\nWe also note that ¯Rt satisfies Assumption 1 with a rescaled constant cw/t and normalization-invariant\ncb, if ¯P satisfies it for cw and cb. Theorem 1 gives a lower bound on the sample complexity for\nNeuRIPs( ¯Rt), completing the proof.\nAt any network where an optimization method terminates, the concentration of the empirical risk\nat the expected risk can be achieved with less data than needed to achieve an analogous NeuRIPs\nevent. However, in the chosen stochastic setting, we cannot assume that the termination of an\noptimization and the norm concentration at that network are independent events. We overcome this\nby not specifying the outcome of an optimization method and instead stating uniform bounds on\nthe norm concentration. The only assumption on an algorithm is therefore the identification of a\nnetwork that permits an upper bound ϵ on its empirical risk. The event NeuRIPs( ¯Rt) then restricts the\nexpected risk to be below the corresponding level t.\n\nWe now discuss the empirical risk surface for generic distributions µ that satisfy Assumption 2, where\ny does not necessarily have to be a neural network.\nTheorem 3. There exist constants C0, C1, C2, C3, C4, and C5 such that the following holds: Let ¯P\nsatisfy Assumption 1 for some constants cw, cb, and let ¯p∗ ∈ ¯P be such that for some c ¯p∗ ≥ 0 we\nhave\n(cid:18) (y − ϕ ¯p∗ (x))2\nc2\n¯p∗\nWe assume, for any s ∈ (0, 1) and confidence parameter u > 0, that the number of samples m is\nlarge enough such that\n\n≤ 2.\n\nexp\n\nEµ\n\n(cid:19)(cid:21)\n\n(cid:20)\n\nm ≥\n\n8\n\n(1 − s)2 max\n\n(cid:18)\n\nC1\n\n(cid:18) n3c2\n\nw(8cb + d + ln(2))\n\n(cid:19)\n\nu\n\n4\n\n, C2n2c2\nw\n\n(cid:17)(cid:19)\n\n.\n\n(cid:16) u\ns\n\n\fWe further select confidence parameters v1, v2 > C0, and define for some ω ≥ 0 the parameter\n\nη := 2(1 − s)∥ϕ ¯p∗ − y∥µ + C3v1v2c ¯p∗\n\n1\n(1 − s)1/4\n\n√\n\n+ ω\n\n1 − s.\n\nIf we set ϵ = ∥ϕ ¯p∗ − y∥2\n¯q ∈ ¯Qy,ϵ satisfy\n\nm + ω2 as the tolerance for the empirical risk, then the probability that all\n\nis at least\n\n∥ϕ¯q − y∥µ ≤ η\n\n1 − 17 exp\n\n(cid:16)\n\n−\n\n(cid:17)\n\nu\n4\n\n(cid:18)\n\n− C5v2 exp\n\n−\n\nC4mv2\n2\n2\n\n(cid:19)\n\n.\n\nProof sketch. (Complete proof in Appendix E) We first define and decompose the excess risk by\n\nE(¯q, ¯p∗) := ∥ϕ¯q − y∥2\n\nµ − ∥ϕ ¯p∗ − y∥2\n\nµ = ∥ϕ¯q − ϕ ¯p∗ ∥2\n\nµ −\n\n2\nm\n\nm\n(cid:88)\n\nj=1\n\n(ϕ ¯p∗ (xj) − yj)(ϕ¯q(xj) − ϕ ¯p∗ (xj)).\n\nIt suffices to show, that within the stated confidence level we have ∥ϕ¯q − y∥µ > η . This implies the\nclaim since ∥ϕ¯q − y∥m ≤ ϵ implies ∥ϕ¯q − y∥µ ≤ η. We have E[E(¯q, ¯p∗)] > 0. It now only remains\nto strengthen the condition on η > 3∥ϕ ¯p∗ − y∥µ to achieve E(¯q, ¯p∗) > ω2. We apply Theorem 1\nto derive a bound on the fluctuation of the first term. The concentration rate of the second term is\nderived similar to Theorem 1 by using chaining techniques. Finally in Appendix E, Theorem 12 gives\na general bound to achieve\n\nE(¯q, ¯p∗) > ω2\n\nuniformly for all ¯q with ∥ϕ¯q − ϕ ¯p∗ ∥µ > η. Theorem 3 then follows as a simplification.\n\nIt is important to notice that, in Theorem 3, as the data size m approaches infinity, one can select\nan asymptotically small deviation constant s. In this limit, the bound η on the generalization error\nconverges to 3∥ϕ ¯p∗ − y∥µ + ω. This reflects a lower limit of the generalization bound, which is the\nsum of the theoretically achievable minimum of the expected risk and the additional tolerance ω.\nThe latter is an upper bound on the empirical risk, which real-world optimization algorithms can be\nexpected to achieve.\n\n5 Size Control of Stochastic Processes on Shallow Networks\n\nIn this section, we introduce the key techniques for deriving concentration statements for the em-\npirical norm, uniformly valid for sets of shallow ReLU networks. We begin by rewriting the event\nNeuRIPs( ¯P ) by treating µ as a stochastic process, indexed by the parameter set ¯P . The event\nNeuRIPs( ¯P ) holds if and only if we have\n\nsup\n¯p∈ ¯P\n\n|∥ϕ ¯p∥m − ∥ϕ ¯p∥µ| ≤ s sup\n¯p∈ ¯P\n\n∥ϕ ¯p∥µ.\n\nThe supremum of stochastic processes has been studied in terms of their size. To determine the size\nof a process, it is essential to determine the correlation between its variables. To this end, we define\nthe Sub-Gaussian metric for any parameter tuples ¯p, ¯q ∈ ¯P as\n\n(cid:40)\n\n(cid:34)\n\n(cid:32)\n\ndψ2(ϕ ¯p, ϕ¯q) := inf\n\nCψ2 ≥ 0 : E\n\nexp\n\n|ϕ ¯p(x) − ϕ¯q(x)|2\nC 2\nψ2\n\n(cid:33)(cid:35)\n\n(cid:41)\n\n≤ 2\n\n.\n\nA small Sub-Gaussian metric between random variables indicates that their values are likely to be\nclose. To capture the Sub-Gaussian structure of a process, we introduce ϵ-nets in the Sub-Gaussian\nmetric. For a given ϵ > 0, these are subsets ¯Q ⊆ ¯P such that for every ¯p ∈ ¯P , there is a ¯q ∈ ¯Q\nsatisfying\n\ndψ2 (ϕ ¯p, ϕ¯q) ≤ ϵ.\nThe smallest cardinality of such an ϵ-net ¯Q is known as the Sub-Gaussian covering number\nN (Φ ¯P , dψ2, ϵ). The next Lemma offers a bound for such covering numbers specific to shallow\nReLU networks.\n\n5\n\n\fLemma 1. Let ¯P be a parameter set satisfying Assumption 1. Then there exists a set ˆP with ¯P ⊆ ˆP\nsuch that\n\nN (Φ ˆP , dψ2, ϵ) ≤ 2n ·\n\n(cid:18) 16ncbcw\nϵ\n\n(cid:19)n\n\n+ 1\n\n(cid:18) 32ncbcw\nϵ\n\n·\n\n(cid:19)n\n\n+ 1\n\n(cid:18) 1\nϵ\n\n·\n\nsin\n\n(cid:18) 1\n\n16ncw\n\n(cid:19)\n\n(cid:19)d\n\n+ 1\n\n.\n\nThe proof of this Lemma is based on the theory of stochastic processes and can be seen in Theorem 8\nof Appendix C.\n\nTo obtain bounds of the form (6) on the size of a process, we use the generic chaining method. This\nmethod offers bounds in terms of the Talagrand-functional of the process in the Sub-Gaussian metric.\nWe define it as follows. A sequence T = (Tk)k∈N0 in a set T is admissible if T0 = 1 and Tk ≤ 2(2k).\nThe Talagrand-functional of the metric space is then defined as\n\nγ2(T, d) := inf\n(Tk)\n\nsup\nt∈T\n\n∞\n(cid:88)\n\nk=0\n\n2kd(t, Tk),\n\nwhere the infimum is taken across all admissible sequences.\n\nWith the bounds on the Sub-Gaussian covering number from Lemma 1, we provide a bound on the\nTalagrand-functional for shallow ReLU networks in the following Lemma. This bound is expected to\nbe of independent interest.\nLemma 2. Let ¯P satisfy Assumption 1. Then we have\n\nγ2(Φ ¯P , dψ2 ) ≤\n\n(cid:114) 2\nπ\n\n(cid:18) 8n3/2cw(8cb + d + 1)\nln(2)\n\n(cid:19)\n(cid:112)2 ln(2)\n\n.\n\nThe key ideas to show this bound are similar to the ones used to prove Theorem 9 in Appendix C.\n\nTo provide bounds for the empirical process, we use the following Lemma, which we prove in\nAppendix D.\nLemma 3. Let Φ be a set of real functions, indexed by a parameter set ¯P and define\n\nN (Φ) :=\n\n(cid:90) ∞\n\n(cid:113)\n\n0\n\nln N (Φ, dψ2, ϵ)dϵ\n\nand ∆(Φ) := sup\nϕ∈Φ\n\n∥ϕ∥ψ2 .\n\nThen, for any u ≥ 2, we have with probability at least 1 − 17 exp(−u/4) that\n\n|∥ϕ∥m − ∥ϕ∥µ| ≤\n\nsup\nϕ∈Φ\n\nu\n√\nm\n\n(cid:20)\n\nN (Φ) +\n\n(cid:21)\n\n∆(Φ)\n\n.\n\n10\n3\n\nThe bounds on the sample complexity for achieving the NeuRIPs event, from Theorem 1, are proven\nby applying these Lemmata.\nProof of Theorem 1. Since we assume ||ϕ ¯p||µ > 1 for all ¯p ∈ ¯P , we have\n\nsup\n¯p∈ ¯P\n\n|∥ϕ ¯p∥m − ∥ϕ ¯p∥µ| ≤ sup\n¯p∈ ¯P\n\n|∥ϕ ¯p∥m − ∥ϕ ¯p∥µ|/∥ϕ ¯p∥µ.\n\nApplying Lemma 3, and further applying the bounds on the covering numbers and the Talagrand-\nfunctional for shallow ReLU networks, the NeuRIPs( ¯P ) event holds in case of s > 3. The sample\ncomplexities that are provided in Theorem 1 follow from a refinement of this condition.\n\n6 Uniform Generalization of Sublevel Sets of the Empirical Risk\n\nIn case of the NeuRIPs event, the function norm || · ||µ corresponding to the expected risk is close\nto || · ||m, which corresponds to the empirical risk. With the previous results, we can now derive\nuniform generalization error bounds in the sublevel set of the empirical risk.\n\nWe use similar techniques and we define the following sets.\n\n∥f ∥p = sup\n1≤q≤p\n\n∥f ∥q\n\nΛk0,u = inf\n(Tk)\n\nsup\nf ∈F\n\n∞\n(cid:88)\n\nk0\n\n6\n\n2k∥f − Tk(f )∥u2k\n\n\fand we need the following lemma:\n\nLemma 9. For any set F of functions and u ≥ 1, we have\n\nΛ0,u(F ) ≤ 2\n\n√\n\ne(γ2(F, dψ2) + ∆(F )).\n\nTheorem 10. Let P be a parameter set satisfying Assumption 1. Then, for any u ≥ 1, we have with\nprobability at least 1 − 17 exp(−u/4) that\n\n∥ϕ ¯p∥m − ∥ϕ ¯p∥µ ≤\n\nsup\n¯p∈P\n\n(cid:16)\n\nu\n√\nm\n\n16n3/2cw(8cb + d + 1) + 2ncw\n\n(cid:17)\n\n.\n\nProof. To this end we have to bound the Talagrand functional, where we can use Dudley’s inequality\n(Lemma 6). To finish the proof, we apply the bounds on the covering numbers provided by Theorem\n6.\nTheorem 11. Let ¯P ⊆ (Rd × R × ±1)n satisfy Assumption 1. Then there exist universal constants\nC1, C2 such that\n\n∥ϕ ¯p∥m − ∥ϕ ¯p∥µ ≤\n\nsup\n¯p∈P\n\n(cid:114) 2\nπ\n\n(cid:18) 8n3/2cw(8cb + d + 1)\nln(2)\n\n(cid:19)\n(cid:112)2 ln(2)\n\n.",
  "related_work": "",
  "methodology": "",
  "experiments": "",
  "results": "functions other than ReLU. This proposition is based on the concentration of measure phenomenon,\nwhich provides bounds on the Sub-Gaussian norm of functions on normal concentrating input spaces.\nBecause these bounds scale with the Lipschitz constant of the function, they can be used to find ϵ-nets\nfor neurons that have identical activation patterns.\n\nBroader Impact\n\nSupervised machine learning now affects both personal and public lives significantly. Generalization is\ncritical to the reliability and safety of empirically trained models. Our analysis aims to achieve a deeper\nunderstanding of the relationships between generalization, architectural design, and available data.\nWe have discussed the concepts and demonstrated the effectiveness of using uniform concentration\nevents for generalization guarantees of common supervised machine learning algorithms.\n\n7",
  "conclusion": "concentration events for the empirical norm. We defined the Neural Restricted Isometry Property\n(NeuRIPs) and determined the sample complexity required to achieve NeuRIPs, which depends on\nrealistic parameter bounds and the network architecture. We applied our findings to derive upper\nbounds on the expected risk, which are valid uniformly across sublevel sets of the empirical risk.\nIf a network optimization algorithm can identify a network with a small empirical risk, our results\nguarantee that this network will generalize well. By deriving uniform concentration statements, we\nhave resolved the problem of independence between the termination of an optimization algorithm at\na certain network and the empirical risk concentration at that network. Future studies may focus on\nperforming uniform empirical norm concentration on the critical points of the empirical risk, which\ncould lead to even tighter bounds for the sample complexity.\n\nWe also plan to apply our methods to input distributions more general than the Gaussian distribution.\nIf generic Gaussian distributions can be handled, one could then derive bounds for the Sub-Gaussian\ncovering number for deep ReLU networks by induction across layers. We also expect that our",
  "is_publishable": 1,
  "venue": "NeurIPS"
}